# По введенным пользователем координатам двух точек вывести уравнение прямой
# вида y = kx + b, проходящей через эти точки.

print('Введите координаты первой точки')
X1 = int(input('X: '))
Y1 = int(input('Y: '))

print('Введите координаты второй точки')
X2 = int(input('X: '))
Y2 = int(input('Y: '))

# Расчёт коэффициентов уравнения
K =  f'{abs(Y1 - Y2)}/{abs(X2 - X1)}' if not ((Y1 - Y2)%(X2 - X1)) == 0 else abs((Y1 - Y2)//(X2 - X1))
C =  f'{abs(X1*Y2 - X2*Y1)}/{abs(X2 - X1)}' if not ((X1*Y2 - X2*Y1)%(X2 - X1)) == 0 else abs((X1*Y2 - X2*Y1)//(X2 - X1))

# Вывод уравнения прямой
print(f'Функция прямой: Y = {("-" if ((Y1 - Y2)//(X2 - X1)) >= 0 else "+")} {K}X {("-" if (X1*Y2 - X2*Y1)//(X2 - X1) >= 0 else "+")} {C}')